Tekla Open API Reference for Tekla Structures 2025
Weld.Attributes Property
 The attributes of the weld. For more information see Weld.WeldAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Weld.WeldAttributes Attributes { get; set; }
Public Property Attributes As Weld.WeldAttributes
	Get
	Set
Property Value
Type: Weld.WeldAttributes
See Also
Reference
Weld Class
Tekla.Structures.Drawing Namespace